app/views/pages/home.html.erb

SELECT "redweets".* FROM "redweets" WHERE (user_id IN (NULL) OR user_id = 4 )  ORDER BY "redweets"."created_at" DESC
---
                     REDWEETS<br>
                     <h6 style="color: #0084B4; font-size: 200%;"><%= current_user.redweet.count %></h6>

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 4]]
---

               <% if User.find(@redweet.user_id).image_file_size != nil%>