app/views/pages/moments.html.erb

            <div class="col-sm-11">
              <p class="post-title"><span class="post-owner"><a href="/user/<%= User.find(@redweet.user_id).username %>"><%= User.find(@redweet.user_id).username %></a></span> <span class="post-creation">- <%= @redweet.created_at.to_formatted_s(:short) %></span></p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 4]]