app/controllers/pages_controller.rb

SELECT "redweets".* FROM "redweets" WHERE (user_id IN (NULL) OR user_id = 4 )  ORDER BY "redweets"."created_at" DESC
---
  def home
    @redweets = Redweet.all

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "juao"]]
SELECT "redweets".* FROM "redweets" WHERE (user_id = 4)  ORDER BY "redweets"."created_at" DESC
---
  def profile

    #capturar o username a partir da Url com id
    if( User.find_by_username(params[:id]))
    @username = params[:id]
    else
      #senao possuir este usuario, redireciona para o 404
      redirect_to root_path, :notice=> "User not found!"
    end

    #disponibilizando somente os posts do proprio usuario
    #@posts = Redweet.all.where("user_id = ?", User.find_by_username(params[:id]).id)
    @redweets = Redweet.all

SELECT "redweets".* FROM "redweets"  ORDER BY "redweets"."created_at" DESC
SELECT  "users".* FROM "users"  ORDER BY "users"."id" DESC LIMIT 7
---
  def moments
    @newRedweet = Redweet.new
    @redweets = Redweet.all
    @quemSeguir = User.all.last(7)