app/controllers/pages_controller.rb

SELECT "posts".* FROM "posts"  ORDER BY "posts"."created_at" DESC
---
  def home
    @posts = Post.all

SELECT "posts".* FROM "posts" WHERE (user_id = 3)  ORDER BY "posts"."created_at" DESC
---
  def profile

    #capturar o username a partir da Url com id
    if( User.find_by_username(params[:id]))
    @username = params[:id]
    else
      #senao possuir este usuario, redireciona para o 404
      redirect_to root_path, :notice=> "User not found!"
    end

    #disponibilizando somente os posts do proprio usuario
    #@posts = Post.all.where("user_id = ?", User.find_by_username(params[:id]).id)
    @posts = Post.all

SELECT "posts".* FROM "posts"  ORDER BY "posts"."created_at" DESC
---
  def explore
    @posts = Post.all