app/controllers/pages_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]
---
  def profile
    #capturar o username a partir da Url com id
    if( User.find_by_username(params[:id]))
      @username = params[:id]
      @u= User.find_by_username(params[:id])
    else
      #senao possuir este usuario, redireciona com o alerta
      redirect_to root_path, :notice=> "User not found!"
    end

    #disponibilizando somente os redweets do proprio usuario
    @redweets = Redweet.where("user_id = ?", User.find_by_username(params[:id]).id)