app/controllers/posts_controller.rb

   def create
     @redweet = Post.new(post_params)
     @redweet.user_id = current_user.id #o redweet recebe o id do usuario que o fez
    respond_to do |f|
        if(@redweet.save)
---
INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "E aeeeee"], ["user_id", 3], ["created_at", "2017-01-12 03:12:34.793050"], ["updated_at", "2017-01-12 03:12:34.793050"]]