app/controllers/redweets_controller.rb

   def create
     @redweet = Redweet.new(redweet_params)
     @redweet.user_id = current_user.id #o redweet recebe o id do usuario que o fez
    respond_to do |f|
        if(@redweet.save)
---
INSERT INTO "redweets" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "E aee"], ["user_id", 3], ["created_at", "2017-01-12 18:19:27.478557"], ["updated_at", "2017-01-12 18:19:27.478557"]]