app/controllers/relationships_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 4]]
---
    def create
        #encontro o usuario do perfil a ser seguido
        user = User.find(params[:followed_id])

SELECT  "relationships".* FROM "relationships" WHERE "relationships"."id" = ? LIMIT 1  [["id", 1]]
---
    def destroy
        #encontro qual o usuario que estou deixando de seguir
        user = Relationship.find(params[:id]).followed